###############################################################
#  Generated by:      Cadence Innovus 19.10-p002_1
#  OS:                Linux x86_64(Host ID en4192789rl)
#  Generated on:      Sat Mar 30 18:30:15 2024
#  Design:            adder32
#  Command:           saveDesign adder16.cts.enc
###############################################################
current_design adder32
create_clock [get_ports {clk}]  -name clk -period 900.000000 -waveform {0.000000 450.000000}
set_clock_transition  -rise -min 0.1 [get_clocks {clk}]
set_clock_transition  -rise -max 0.1 [get_clocks {clk}]
set_clock_transition  -fall -min 0.1 [get_clocks {clk}]
set_clock_transition  -fall -max 0.1 [get_clocks {clk}]
set_propagated_clock  [get_ports {clk}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {clk}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {clk}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {clk}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {clk}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {rst}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {rst}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {rst}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {rst}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {en}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {en}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {en}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {en}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[31]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[31]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[31]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[31]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[30]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[30]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[30]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[30]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[29]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[29]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[29]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[29]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[28]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[28]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[28]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[28]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[27]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[27]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[27]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[27]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[26]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[26]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[26]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[26]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[25]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[25]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[25]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[25]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[24]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[24]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[24]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[24]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[23]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[23]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[23]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[23]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[22]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[22]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[22]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[22]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[21]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[21]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[21]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[21]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[20]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[20]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[20]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[20]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[19]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[19]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[19]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[19]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[18]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[18]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[18]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[18]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[17]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[17]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[17]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[17]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[16]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[16]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[16]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[16]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[15]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[15]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[15]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[15]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[14]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[14]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[14]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[14]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[13]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[13]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[13]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[13]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[12]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[12]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[12]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[12]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[11]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[11]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[11]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[11]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[10]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[10]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[10]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[10]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[9]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[9]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[9]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[9]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[8]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[8]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[8]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[8]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[7]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[7]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[7]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[7]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[6]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[6]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[6]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[6]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[5]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[5]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[5]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[5]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[4]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[4]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[4]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[4]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[3]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[3]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[3]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[3]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[2]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[2]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[2]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[2]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[1]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[1]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[1]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[1]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {a[0]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {a[0]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {a[0]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {a[0]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[31]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[31]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[31]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[31]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[30]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[30]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[30]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[30]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[29]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[29]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[29]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[29]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[28]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[28]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[28]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[28]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[27]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[27]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[27]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[27]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[26]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[26]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[26]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[26]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[25]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[25]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[25]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[25]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[24]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[24]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[24]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[24]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[23]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[23]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[23]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[23]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[22]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[22]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[22]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[22]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[21]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[21]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[21]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[21]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[20]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[20]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[20]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[20]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[19]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[19]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[19]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[19]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[18]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[18]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[18]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[18]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[17]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[17]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[17]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[17]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[16]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[16]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[16]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[16]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[15]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[15]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[15]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[15]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[14]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[14]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[14]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[14]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[13]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[13]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[13]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[13]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[12]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[12]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[12]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[12]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[11]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[11]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[11]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[11]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[10]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[10]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[10]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[10]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[9]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[9]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[9]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[9]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[8]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[8]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[8]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[8]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[7]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[7]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[7]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[7]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[6]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[6]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[6]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[6]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[5]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[5]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[5]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[5]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[4]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[4]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[4]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[4]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[3]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[3]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[3]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[3]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[2]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[2]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[2]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[2]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[1]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[1]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[1]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[1]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -min [get_ports {b[0]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -min [get_ports {b[0]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -rise -max [get_ports {b[0]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R -fall -max [get_ports {b[0]}]
set_load -pin_load -max  0.01  [get_ports {z[31]}]
set_load -pin_load -min  0.01  [get_ports {z[31]}]
set_load -pin_load -max  0.01  [get_ports {z[30]}]
set_load -pin_load -min  0.01  [get_ports {z[30]}]
set_load -pin_load -max  0.01  [get_ports {z[29]}]
set_load -pin_load -min  0.01  [get_ports {z[29]}]
set_load -pin_load -max  0.01  [get_ports {z[28]}]
set_load -pin_load -min  0.01  [get_ports {z[28]}]
set_load -pin_load -max  0.01  [get_ports {z[27]}]
set_load -pin_load -min  0.01  [get_ports {z[27]}]
set_load -pin_load -max  0.01  [get_ports {z[26]}]
set_load -pin_load -min  0.01  [get_ports {z[26]}]
set_load -pin_load -max  0.01  [get_ports {z[25]}]
set_load -pin_load -min  0.01  [get_ports {z[25]}]
set_load -pin_load -max  0.01  [get_ports {z[24]}]
set_load -pin_load -min  0.01  [get_ports {z[24]}]
set_load -pin_load -max  0.01  [get_ports {z[23]}]
set_load -pin_load -min  0.01  [get_ports {z[23]}]
set_load -pin_load -max  0.01  [get_ports {z[22]}]
set_load -pin_load -min  0.01  [get_ports {z[22]}]
set_load -pin_load -max  0.01  [get_ports {z[21]}]
set_load -pin_load -min  0.01  [get_ports {z[21]}]
set_load -pin_load -max  0.01  [get_ports {z[20]}]
set_load -pin_load -min  0.01  [get_ports {z[20]}]
set_load -pin_load -max  0.01  [get_ports {z[19]}]
set_load -pin_load -min  0.01  [get_ports {z[19]}]
set_load -pin_load -max  0.01  [get_ports {z[18]}]
set_load -pin_load -min  0.01  [get_ports {z[18]}]
set_load -pin_load -max  0.01  [get_ports {z[17]}]
set_load -pin_load -min  0.01  [get_ports {z[17]}]
set_load -pin_load -max  0.01  [get_ports {z[16]}]
set_load -pin_load -min  0.01  [get_ports {z[16]}]
set_load -pin_load -max  0.01  [get_ports {z[15]}]
set_load -pin_load -min  0.01  [get_ports {z[15]}]
set_load -pin_load -max  0.01  [get_ports {z[14]}]
set_load -pin_load -min  0.01  [get_ports {z[14]}]
set_load -pin_load -max  0.01  [get_ports {z[13]}]
set_load -pin_load -min  0.01  [get_ports {z[13]}]
set_load -pin_load -max  0.01  [get_ports {z[12]}]
set_load -pin_load -min  0.01  [get_ports {z[12]}]
set_load -pin_load -max  0.01  [get_ports {z[11]}]
set_load -pin_load -min  0.01  [get_ports {z[11]}]
set_load -pin_load -max  0.01  [get_ports {z[10]}]
set_load -pin_load -min  0.01  [get_ports {z[10]}]
set_load -pin_load -max  0.01  [get_ports {z[9]}]
set_load -pin_load -min  0.01  [get_ports {z[9]}]
set_load -pin_load -max  0.01  [get_ports {z[8]}]
set_load -pin_load -min  0.01  [get_ports {z[8]}]
set_load -pin_load -max  0.01  [get_ports {z[7]}]
set_load -pin_load -min  0.01  [get_ports {z[7]}]
set_load -pin_load -max  0.01  [get_ports {z[6]}]
set_load -pin_load -min  0.01  [get_ports {z[6]}]
set_load -pin_load -max  0.01  [get_ports {z[5]}]
set_load -pin_load -min  0.01  [get_ports {z[5]}]
set_load -pin_load -max  0.01  [get_ports {z[4]}]
set_load -pin_load -min  0.01  [get_ports {z[4]}]
set_load -pin_load -max  0.01  [get_ports {z[3]}]
set_load -pin_load -min  0.01  [get_ports {z[3]}]
set_load -pin_load -max  0.01  [get_ports {z[2]}]
set_load -pin_load -min  0.01  [get_ports {z[2]}]
set_load -pin_load -max  0.01  [get_ports {z[1]}]
set_load -pin_load -min  0.01  [get_ports {z[1]}]
set_load -pin_load -max  0.01  [get_ports {z[0]}]
set_load -pin_load -min  0.01  [get_ports {z[0]}]
set_load -pin_load -max  0.01  [get_ports {output_ready}]
set_load -pin_load -min  0.01  [get_ports {output_ready}]
set_wire_load_mode enclosed
set_max_fanout 16  [get_designs {adder32}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[6]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[16]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[23]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[2]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[30]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[31]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[24]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[17]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[2]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[12]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[20]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[13]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[29]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[7]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[28]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[7]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[17]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[24]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[25]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[18]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {rst}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[3]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[31]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[3]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[13]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[20]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[21]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[14]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[8]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[29]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[10]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[8]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[18]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[25]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[4]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[26]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[19]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[4]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[14]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[21]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[0]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[22]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[15]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[0]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[10]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {en}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[11]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[9]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[9]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[19]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[26]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[27]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[5]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[5]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[15]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[22]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[1]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[30]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[23]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[16]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[1]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[11]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[12]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[27]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[6]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[28]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[28]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[19]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[26]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[8]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[17]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[24]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[31]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {output_ready}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[6]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[15]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[22]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[4]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[13]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[20]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[2]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[11]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[0]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[29]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[27]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[9]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[18]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[25]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[7]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[16]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[23]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[30]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[5]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[14]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[21]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[3]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[12]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[1]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {z[10]}]
set_clock_uncertainty 0.01 [get_clocks {clk}]
