###################################################################

# Created by write_sdc on Sat Mar 30 14:35:01 2024

###################################################################
set sdc_version 2.1

set_units -time ps -resistance kOhm -capacitance fF -voltage V -current mA
set_wire_load_mode segmented
set_max_fanout 16 [current_design]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports clk]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports rst]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports en]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {a[15]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {a[14]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {a[13]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {a[12]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {a[11]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {a[10]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {a[9]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {a[8]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {a[7]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {a[6]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {a[5]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {a[4]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {a[3]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {a[2]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {a[1]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {a[0]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {b[15]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {b[14]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {b[13]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {b[12]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {b[11]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {b[10]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {b[9]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {b[8]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {b[7]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {b[6]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {b[5]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {b[4]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {b[3]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {b[2]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {b[1]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {b[0]}]
set_load -pin_load 0.01 [get_ports {z[15]}]
set_load -pin_load 0.01 [get_ports {z[14]}]
set_load -pin_load 0.01 [get_ports {z[13]}]
set_load -pin_load 0.01 [get_ports {z[12]}]
set_load -pin_load 0.01 [get_ports {z[11]}]
set_load -pin_load 0.01 [get_ports {z[10]}]
set_load -pin_load 0.01 [get_ports {z[9]}]
set_load -pin_load 0.01 [get_ports {z[8]}]
set_load -pin_load 0.01 [get_ports {z[7]}]
set_load -pin_load 0.01 [get_ports {z[6]}]
set_load -pin_load 0.01 [get_ports {z[5]}]
set_load -pin_load 0.01 [get_ports {z[4]}]
set_load -pin_load 0.01 [get_ports {z[3]}]
set_load -pin_load 0.01 [get_ports {z[2]}]
set_load -pin_load 0.01 [get_ports {z[1]}]
set_load -pin_load 0.01 [get_ports {z[0]}]
set_load -pin_load 0.01 [get_ports output_ready]
create_clock [get_ports clk]  -period 900  -waveform {0 450}
set_clock_uncertainty 0.01  [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -min -fall 0.1 [get_clocks clk]
set_input_delay -clock clk  0.1  [get_ports rst]
set_input_delay -clock clk  0.1  [get_ports en]
set_input_delay -clock clk  0.1  [get_ports {a[15]}]
set_input_delay -clock clk  0.1  [get_ports {a[14]}]
set_input_delay -clock clk  0.1  [get_ports {a[13]}]
set_input_delay -clock clk  0.1  [get_ports {a[12]}]
set_input_delay -clock clk  0.1  [get_ports {a[11]}]
set_input_delay -clock clk  0.1  [get_ports {a[10]}]
set_input_delay -clock clk  0.1  [get_ports {a[9]}]
set_input_delay -clock clk  0.1  [get_ports {a[8]}]
set_input_delay -clock clk  0.1  [get_ports {a[7]}]
set_input_delay -clock clk  0.1  [get_ports {a[6]}]
set_input_delay -clock clk  0.1  [get_ports {a[5]}]
set_input_delay -clock clk  0.1  [get_ports {a[4]}]
set_input_delay -clock clk  0.1  [get_ports {a[3]}]
set_input_delay -clock clk  0.1  [get_ports {a[2]}]
set_input_delay -clock clk  0.1  [get_ports {a[1]}]
set_input_delay -clock clk  0.1  [get_ports {a[0]}]
set_input_delay -clock clk  0.1  [get_ports {b[15]}]
set_input_delay -clock clk  0.1  [get_ports {b[14]}]
set_input_delay -clock clk  0.1  [get_ports {b[13]}]
set_input_delay -clock clk  0.1  [get_ports {b[12]}]
set_input_delay -clock clk  0.1  [get_ports {b[11]}]
set_input_delay -clock clk  0.1  [get_ports {b[10]}]
set_input_delay -clock clk  0.1  [get_ports {b[9]}]
set_input_delay -clock clk  0.1  [get_ports {b[8]}]
set_input_delay -clock clk  0.1  [get_ports {b[7]}]
set_input_delay -clock clk  0.1  [get_ports {b[6]}]
set_input_delay -clock clk  0.1  [get_ports {b[5]}]
set_input_delay -clock clk  0.1  [get_ports {b[4]}]
set_input_delay -clock clk  0.1  [get_ports {b[3]}]
set_input_delay -clock clk  0.1  [get_ports {b[2]}]
set_input_delay -clock clk  0.1  [get_ports {b[1]}]
set_input_delay -clock clk  0.1  [get_ports {b[0]}]
set_output_delay -clock clk  0.1  [get_ports {z[15]}]
set_output_delay -clock clk  0.1  [get_ports {z[14]}]
set_output_delay -clock clk  0.1  [get_ports {z[13]}]
set_output_delay -clock clk  0.1  [get_ports {z[12]}]
set_output_delay -clock clk  0.1  [get_ports {z[11]}]
set_output_delay -clock clk  0.1  [get_ports {z[10]}]
set_output_delay -clock clk  0.1  [get_ports {z[9]}]
set_output_delay -clock clk  0.1  [get_ports {z[8]}]
set_output_delay -clock clk  0.1  [get_ports {z[7]}]
set_output_delay -clock clk  0.1  [get_ports {z[6]}]
set_output_delay -clock clk  0.1  [get_ports {z[5]}]
set_output_delay -clock clk  0.1  [get_ports {z[4]}]
set_output_delay -clock clk  0.1  [get_ports {z[3]}]
set_output_delay -clock clk  0.1  [get_ports {z[2]}]
set_output_delay -clock clk  0.1  [get_ports {z[1]}]
set_output_delay -clock clk  0.1  [get_ports {z[0]}]
set_output_delay -clock clk  0.1  [get_ports output_ready]
